#### Terraform Plan Summary: ⚠️ Changes

Plan: 745 to add, 0 to change, 0 to destroy.

<details><summary>Show Redacted Plan</summary>

```hcl
[command]/home/runner/work/_temp/9abb5ccb-bd3b-4f54-8575-77b7ee3dbdf0/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate_validation.cert will be created
  + resource "aws_acm_certificate_validation" "cert" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_autoscaling_policy.MyScaleDownPolicy will be created
  + resource "aws_autoscaling_policy" "MyScaleDownPolicy" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = (known after apply)
      + cooldown                = 180
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "MyScaleDownPolicy"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = -1
    }

  # aws_autoscaling_policy.MyScaleUpPolicy will be created
  + resource "aws_autoscaling_policy" "MyScaleUpPolicy" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = (known after apply)
      + cooldown                = 60
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "MyScaleUpPolicy"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = 2
    }

  # aws_cloudwatch_metric_alarm.scale-down will be created
  + resource "aws_cloudwatch_metric_alarm" "scale-down" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Scale down if CPU utilization is less than 20% for 1 minute"
      + alarm_name                            = "ScaleDown"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/EC2"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 20
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.scale-up will be created
  + resource "aws_cloudwatch_metric_alarm" "scale-up" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Scale up if CPU utilization is greater than 40% for 5 minutes"
      + alarm_name                            = "ScaleUp"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/EC2"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 40
      + treat_missing_data                    = "missing"
    }

  # aws_route53_record.acm_validation["shodapp.seansalmassi.com"] will be created
  + resource "aws_route53_record" "acm_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z00891131OSP4IF3CZM29"
    }

  # aws_route53_record.seansalmassi-com will be created
  + resource "aws_route53_record" "seansalmassi-com" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "shodapp.seansalmassi.com"
      + type            = "A"
      + zone_id         = "Z00891131OSP4IF3CZM29"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_security_group.Allow_services will be created
  + resource "aws_security_group" "Allow_services" {
      + arn                    = (known after apply)
      + description            = "global rule"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All traffic_out"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All traffic_in"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "traffic in HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "traffic in HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "PROD"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_wafv2_ip_set.allow_ips will be created
  + resource "aws_wafv2_ip_set" "allow_ips" {
      + addresses          = [
          + "2.54.190.165/32",
          + "31.154.46.114/32",
          + "84.228.161.67/32",
        ]
      + arn                = (known after apply)
      + description        = "IPset"
      + id                 = (known after apply)
      + ip_address_version = "IPV4"
      + lock_token         = (known after apply)
      + name               = "sean-ip-and-shlomo"
      + scope              = "REGIONAL"
      + tags_all           = (known after apply)
    }

  # aws_wafv2_regex_pattern_set.allowed-url will be created
  + resource "aws_wafv2_regex_pattern_set" "allowed-url" {
      + arn        = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "allow-spesific-html"
      + scope      = "REGIONAL"
      + tags_all   = (known after apply)

      + regular_expression {
          + regex_string = "^/.host_results.html+"
        }
      + regular_expression {
          + regex_string = "^/.results.html+"
        }
      + regular_expression {
          + regex_string = "^/search_by_filters.html+"
        }
      + regular_expression {
          + regex_string = "^/search_by_ip.html+"
        }
    }

  # aws_wafv2_regex_pattern_set.invalid_url will be created
  + resource "aws_wafv2_regex_pattern_set" "invalid_url" {
      + arn        = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "block_all_after_slash"
      + scope      = "REGIONAL"
      + tags_all   = (known after apply)

      + regular_expression {
          + regex_string = "^/.+"
        }
    }

  # module.acm.aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "shodapp.seansalmassi.com"
      + domain_validation_options = [
          + {
              + domain_name           = "shodapp.seansalmassi.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "shodapp.seansalmassi.com",
        ]
      + tags                      = {
          + "Name" = "shodapp.seansalmassi.com"
        }
      + tags_all                  = {
          + "Name" = "shodapp.seansalmassi.com"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.acm.aws_acm_certificate_validation.this[0] will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn = (known after apply)
      + id              = (known after apply)

      + timeouts {}
    }

  # module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = "ipv4"
      + load_balancer_type                                           = "application"
      + name                                                         = "asg-prod"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Environment" = "Production"
          + "Name"        = "asg-prod"
        }
      + tags_all                                                     = {
          + "Environment" = "Production"
          + "Name"        = "asg-prod"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.alb.aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "Environment" = "Production"
        }
      + tags_all          = {
          + "Environment" = "Production"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + mutual_authentication {
          + ignore_client_certificate_expiry = (known after apply)
          + mode                             = (known after apply)
          + trust_store_arn                  = (known after apply)
        }
    }

  # module.alb.aws_lb_listener.frontend_https[0] will be created
  + resource "aws_lb_listener" "frontend_https" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags              = {
          + "Environment" = "Production"
        }
      + tags_all          = {
          + "Environment" = "Production"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication {
          + ignore_client_certificate_expiry = (known after apply)
          + mode                             = (known after apply)
          + trust_store_arn                  = (known after apply)
        }
    }

  # module.alb.aws_lb_target_group.main[0] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "Prod"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "Production"
          + "Name"        = "Prod"
        }
      + tags_all                           = {
          + "Environment" = "Production"
          + "Name"        = "Prod"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }

      + target_group_health {
          + dns_failover {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }

          + unhealthy_state_routing {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }
        }

      + target_health_state {
          + enable_unhealthy_connection_termination = (known after apply)
          + unhealthy_draining_interval             = (known after apply)
        }
    }

  # module.asg.aws_autoscaling_group.this[0] will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 3
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 200
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 5
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = "shodapp_auto_scaling_group-"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + termination_policies             = []
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = (known after apply)
              + on_demand_base_capacity                  = (known after apply)
              + on_demand_percentage_above_base_capacity = (known after apply)
              + spot_allocation_strategy                 = (known after apply)
              + spot_instance_pools                      = (known after apply)
              + spot_max_price                           = (known after apply)
            }

          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }

              + override {
                  + instance_type     = (known after apply)
                  + weighted_capacity = (known after apply)

                  + instance_requirements {
                      + accelerator_manufacturers                               = (known after apply)
                      + accelerator_names                                       = (known after apply)
                      + accelerator_types                                       = (known after apply)
                      + allowed_instance_types                                  = (known after apply)
                      + bare_metal                                              = (known after apply)
                      + burstable_performance                                   = (known after apply)
                      + cpu_manufacturers                                       = (known after apply)
                      + excluded_instance_types                                 = (known after apply)
                      + instance_generations                                    = (known after apply)
                      + local_storage                                           = (known after apply)
                      + local_storage_types                                     = (known after apply)
                      + max_spot_price_as_percentage_of_optimal_on_demand_price = (known after apply)
                      + on_demand_max_price_percentage_over_lowest_price        = (known after apply)
                      + require_hibernate_support                               = (known after apply)
                      + spot_max_price_percentage_over_lowest_price             = (known after apply)

                      + accelerator_count {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + accelerator_total_memory_mib {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + baseline_ebs_bandwidth_mbps {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + memory_gib_per_vcpu {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + memory_mib {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + network_bandwidth_gbps {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + network_interface_count {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + total_local_storage_gb {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + vcpu_count {
                          + max = (known after apply)
                          + min = (known after apply)
                        }
                    }

                  + launch_template_specification {
                      + launch_template_id   = (known after apply)
                      + launch_template_name = (known after apply)
                      + version              = (known after apply)
                    }
                }
            }
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "shodapp_auto_scaling_group"
        }

      + timeouts {}

      + traffic_source {
          + identifier = (known after apply)
          + type       = (known after apply)
        }
    }

  # module.asg.aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Launch template for ASG"
      + id                     = (known after apply)
      + image_id               = "ami-052b9fbb6949f883a"
      + instance_type          = "t2.micro"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "shodan-app-launch-template-"
      + tags_all               = (known after apply)
      + update_default_version = true
      + user_data              = (sensitive value)
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "py-prod-proj-vpc-default"
        }
      + tags_all               = {
          + "Name" = "py-prod-proj-vpc-default"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "py-prod-proj-vpc"
        }
      + tags_all = {
          + "Name" = "py-prod-proj-vpc"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "py-prod-proj-vpc-private-us-east-1a"
        }
      + tags_all         = {
          + "Name" = "py-prod-proj-vpc-private-us-east-1a"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "py-prod-proj-vpc-private-us-east-1b"
        }
      + tags_all         = {
          + "Name" = "py-prod-proj-vpc-private-us-east-1b"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "py-prod-proj-vpc-public"
        }
      + tags_all         = {
          + "Name" = "py-prod-proj-vpc-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "py-prod-proj-vpc-private-us-east-1a"
        }
      + tags_all                                       = {
          + "Name" = "py-prod-proj-vpc-private-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "py-prod-proj-vpc-private-us-east-1b"
        }
      + tags_all                                       = {
          + "Name" = "py-prod-proj-vpc-private-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "py-prod-proj-vpc-public-us-east-1a"
        }
      + tags_all                                       = {
          + "Name" = "py-prod-proj-vpc-public-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "py-prod-proj-vpc-public-us-east-1b"
        }
      + tags_all                                       = {
          + "Name" = "py-prod-proj-vpc-public-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.10.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "py-prod-proj-vpc"
        }
      + tags_all                             = {
          + "Name" = "py-prod-proj-vpc"
        }
    }

  # module.waf.aws_wafv2_web_acl.main[0] will be created
  + resource "aws_wafv2_web_acl" "main" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "shodan_waf"
      + scope                       = "REGIONAL"
      + tags_all                    = (known after apply)

      + default_action {

          + block {
            }
        }

      + rule {
          + name     = "Allow_results_html"
          + priority = 0

          + action {
              + allow {
                }
            }

          + statement {

              + regex_pattern_set_reference_statement {
                  + arn = (known after apply)

                  + field_to_match {

                      + uri_path {}
                    }

                  + text_transformation {
                      + priority = 0
                      + type     = "LOWERCASE"
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "RegexBadBotsUserAgent-metric"
              + sampled_requests_enabled   = false
            }
        }
      + rule {
          + name     = "IpSetRule-0"
          + priority = 1

          + action {
              + allow {
                }
            }

          + statement {

              + ip_set_reference_statement {
                  + arn = (known after apply)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "allow-specific-ip"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "Block_all_routes_that_not_allowed"
          + priority = 5

          + action {

              + block {
                }
            }

          + statement {

              + regex_pattern_set_reference_statement {
                  + arn = (known after apply)

                  + field_to_match {

                      + uri_path {}
                    }

                  + text_transformation {
                      + priority = 0
                      + type     = "LOWERCASE"
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "RegexBadBotsUserAgent-metric"
              + sampled_requests_enabled   = false
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "shodan-app"
          + sampled_requests_enabled   = true
        }
    }

  # module.waf.aws_wafv2_web_acl_association.main[0] will be created
  + resource "aws_wafv2_web_acl_association" "main" {
      + id           = (known after apply)
      + resource_arn = (known after apply)
      + web_acl_arn  = (known after apply)
    }

Plan: 36 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb                  = {
      + http_tcp_listener_arns    = [
          + (known after apply),
        ]
      + http_tcp_listener_ids     = [
          + (known after apply),
        ]
      + https_listener_arns       = [
          + (known after apply),
        ]
      + https_listener_ids        = [
          + (known after apply),
        ]
      + lb_arn                    = (known after apply)
      + lb_arn_suffix             = (known after apply)
      + lb_dns_name               = (known after apply)
      + lb_id                     = (known after apply)
      + lb_zone_id                = (known after apply)
      + target_group_arn_suffixes = [
          + (known after apply),
        ]
      + target_group_arns         = [
          + (known after apply),
        ]
      + target_group_attachments  = {}
      + target_group_names        = [
          + (known after apply),
        ]
    }
  + dns_a_record_route53 = "https://shodapp.seansalmassi.com"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_acm_certificate_validation.cert will be created%0A  + resource "aws_acm_certificate_validation" "cert" {%0A      + certificate_arn         = (known after apply)%0A      + id                      = (known after apply)%0A      + validation_record_fqdns = (known after apply)%0A    }%0A%0A  # aws_autoscaling_policy.MyScaleDownPolicy will be created%0A  + resource "aws_autoscaling_policy" "MyScaleDownPolicy" {%0A      + adjustment_type         = "ChangeInCapacity"%0A      + arn                     = (known after apply)%0A      + autoscaling_group_name  = (known after apply)%0A      + cooldown                = 180%0A      + enabled                 = true%0A      + id                      = (known after apply)%0A      + metric_aggregation_type = (known after apply)%0A      + name                    = "MyScaleDownPolicy"%0A      + policy_type             = "SimpleScaling"%0A      + scaling_adjustment      = -1%0A    }%0A%0A  # aws_autoscaling_policy.MyScaleUpPolicy will be created%0A  + resource "aws_autoscaling_policy" "MyScaleUpPolicy" {%0A      + adjustment_type         = "ChangeInCapacity"%0A      + arn                     = (known after apply)%0A      + autoscaling_group_name  = (known after apply)%0A      + cooldown                = 60%0A      + enabled                 = true%0A      + id                      = (known after apply)%0A      + metric_aggregation_type = (known after apply)%0A      + name                    = "MyScaleUpPolicy"%0A      + policy_type             = "SimpleScaling"%0A      + scaling_adjustment      = 2%0A    }%0A%0A  # aws_cloudwatch_metric_alarm.scale-down will be created%0A  + resource "aws_cloudwatch_metric_alarm" "scale-down" {%0A      + actions_enabled                       = true%0A      + alarm_actions                         = (known after apply)%0A      + alarm_description                     = "Scale down if CPU utilization is less than 20%25 for 1 minute"%0A      + alarm_name                            = "ScaleDown"%0A      + arn                                   = (known after apply)%0A      + comparison_operator                   = "LessThanThreshold"%0A      + dimensions                            = (known after apply)%0A      + evaluate_low_sample_count_percentiles = (known after apply)%0A      + evaluation_periods                    = 1%0A      + id                                    = (known after apply)%0A      + metric_name                           = "CPUUtilization"%0A      + namespace                             = "AWS/EC2"%0A      + period                                = 60%0A      + statistic                             = "Average"%0A      + tags_all                              = (known after apply)%0A      + threshold                             = 20%0A      + treat_missing_data                    = "missing"%0A    }%0A%0A  # aws_cloudwatch_metric_alarm.scale-up will be created%0A  + resource "aws_cloudwatch_metric_alarm" "scale-up" {%0A      + actions_enabled                       = true%0A      + alarm_actions                         = (known after apply)%0A      + alarm_description                     = "Scale up if CPU utilization is greater than 40%25 for 5 minutes"%0A      + alarm_name                            = "ScaleUp"%0A      + arn                                   = (known after apply)%0A      + comparison_operator                   = "GreaterThanThreshold"%0A      + dimensions                            = (known after apply)%0A      + evaluate_low_sample_count_percentiles = (known after apply)%0A      + evaluation_periods                    = 1%0A      + id                                    = (known after apply)%0A      + metric_name                           = "CPUUtilization"%0A      + namespace                             = "AWS/EC2"%0A      + period                                = 300%0A      + statistic                             = "Average"%0A      + tags_all                              = (known after apply)%0A      + threshold                             = 40%0A      + treat_missing_data                    = "missing"%0A    }%0A%0A  # aws_route53_record.acm_validation["shodapp.seansalmassi.com"] will be created%0A  + resource "aws_route53_record" "acm_validation" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = (known after apply)%0A      + records         = (known after apply)%0A      + ttl             = 60%0A      + type            = (known after apply)%0A      + zone_id         = "Z00891131OSP4IF3CZM29"%0A    }%0A%0A  # aws_route53_record.seansalmassi-com will be created%0A  + resource "aws_route53_record" "seansalmassi-com" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = "shodapp.seansalmassi.com"%0A      + type            = "A"%0A      + zone_id         = "Z00891131OSP4IF3CZM29"%0A%0A      + alias {%0A          + evaluate_target_health = true%0A          + name                   = (known after apply)%0A          + zone_id                = (known after apply)%0A        }%0A    }%0A%0A  # aws_security_group.Allow_services will be created%0A  + resource "aws_security_group" "Allow_services" {%0A      + arn                    = (known after apply)%0A      + description            = "global rule"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "All traffic_out"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "All traffic_in"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "traffic in HTTP"%0A              + from_port        = 80%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 80%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "traffic in HTTPS"%0A              + from_port        = 443%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 443%0A            },%0A        ]%0A      + name                   = "PROD"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = (known after apply)%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # aws_wafv2_ip_set.allow_ips will be created%0A  + resource "aws_wafv2_ip_set" "allow_ips" {%0A      + addresses          = [%0A          + "2.54.190.165/32",%0A          + "31.154.46.114/32",%0A          + "84.228.161.67/32",%0A        ]%0A      + arn                = (known after apply)%0A      + description        = "IPset"%0A      + id                 = (known after apply)%0A      + ip_address_version = "IPV4"%0A      + lock_token         = (known after apply)%0A      + name               = "sean-ip-and-shlomo"%0A      + scope              = "REGIONAL"%0A      + tags_all           = (known after apply)%0A    }%0A%0A  # aws_wafv2_regex_pattern_set.allowed-url will be created%0A  + resource "aws_wafv2_regex_pattern_set" "allowed-url" {%0A      + arn        = (known after apply)%0A      + id         = (known after apply)%0A      + lock_token = (known after apply)%0A      + name       = "allow-spesific-html"%0A      + scope      = "REGIONAL"%0A      + tags_all   = (known after apply)%0A%0A      + regular_expression {%0A          + regex_string = "^/.host_results.html+"%0A        }%0A      + regular_expression {%0A          + regex_string = "^/.results.html+"%0A        }%0A      + regular_expression {%0A          + regex_string = "^/search_by_filters.html+"%0A        }%0A      + regular_expression {%0A          + regex_string = "^/search_by_ip.html+"%0A        }%0A    }%0A%0A  # aws_wafv2_regex_pattern_set.invalid_url will be created%0A  + resource "aws_wafv2_regex_pattern_set" "invalid_url" {%0A      + arn        = (known after apply)%0A      + id         = (known after apply)%0A      + lock_token = (known after apply)%0A      + name       = "block_all_after_slash"%0A      + scope      = "REGIONAL"%0A      + tags_all   = (known after apply)%0A%0A      + regular_expression {%0A          + regex_string = "^/.+"%0A        }%0A    }%0A%0A  # module.acm.aws_acm_certificate.this[0] will be created%0A  + resource "aws_acm_certificate" "this" {%0A      + arn                       = (known after apply)%0A      + domain_name               = "shodapp.seansalmassi.com"%0A      + domain_validation_options = [%0A          + {%0A              + domain_name           = "shodapp.seansalmassi.com"%0A              + resource_record_name  = (known after apply)%0A              + resource_record_type  = (known after apply)%0A              + resource_record_value = (known after apply)%0A            },%0A        ]%0A      + id                        = (known after apply)%0A      + key_algorithm             = (known after apply)%0A      + not_after                 = (known after apply)%0A      + not_before                = (known after apply)%0A      + pending_renewal           = (known after apply)%0A      + renewal_eligibility       = (known after apply)%0A      + renewal_summary           = (known after apply)%0A      + status                    = (known after apply)%0A      + subject_alternative_names = [%0A          + "shodapp.seansalmassi.com",%0A        ]%0A      + tags                      = {%0A          + "Name" = "shodapp.seansalmassi.com"%0A        }%0A      + tags_all                  = {%0A          + "Name" = "shodapp.seansalmassi.com"%0A        }%0A      + type                      = (known after apply)%0A      + validation_emails         = (known after apply)%0A      + validation_method         = "DNS"%0A%0A      + options {%0A          + certificate_transparency_logging_preference = "ENABLED"%0A        }%0A    }%0A%0A  # module.acm.aws_acm_certificate_validation.this[0] will be created%0A  + resource "aws_acm_certificate_validation" "this" {%0A      + certificate_arn = (known after apply)%0A      + id              = (known after apply)%0A%0A      + timeouts {}%0A    }%0A%0A  # module.alb.aws_lb.this[0] will be created%0A  + resource "aws_lb" "this" {%0A      + arn                                                          = (known after apply)%0A      + arn_suffix                                                   = (known after apply)%0A      + client_keep_alive                                            = 3600%0A      + desync_mitigation_mode                                       = "defensive"%0A      + dns_name                                                     = (known after apply)%0A      + drop_invalid_header_fields                                   = false%0A      + enable_deletion_protection                                   = false%0A      + enable_http2                                                 = true%0A      + enable_tls_version_and_cipher_suite_headers                  = false%0A      + enable_waf_fail_open                                         = false%0A      + enable_xff_client_port                                       = false%0A      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A      + id                                                           = (known after apply)%0A      + idle_timeout                                                 = 60%0A      + internal                                                     = false%0A      + ip_address_type                                              = "ipv4"%0A      + load_balancer_type                                           = "application"%0A      + name                                                         = "asg-prod"%0A      + name_prefix                                                  = (known after apply)%0A      + preserve_host_header                                         = false%0A      + security_groups                                              = (known after apply)%0A      + subnets                                                      = (known after apply)%0A      + tags                                                         = {%0A          + "Environment" = "Production"%0A          + "Name"        = "asg-prod"%0A        }%0A      + tags_all                                                     = {%0A          + "Environment" = "Production"%0A          + "Name"        = "asg-prod"%0A        }%0A      + vpc_id                                                       = (known after apply)%0A      + xff_header_processing_mode                                   = "append"%0A      + zone_id                                                      = (known after apply)%0A%0A      + subnet_mapping {%0A          + allocation_id        = (known after apply)%0A          + ipv6_address         = (known after apply)%0A          + outpost_id           = (known after apply)%0A          + private_ipv4_address = (known after apply)%0A          + subnet_id            = (known after apply)%0A        }%0A%0A      + timeouts {%0A          + create = "10m"%0A          + delete = "10m"%0A          + update = "10m"%0A        }%0A    }%0A%0A  # module.alb.aws_lb_listener.frontend_http_tcp[0] will be created%0A  + resource "aws_lb_listener" "frontend_http_tcp" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + load_balancer_arn = (known after apply)%0A      + port              = 80%0A      + protocol          = "HTTP"%0A      + ssl_policy        = (known after apply)%0A      + tags              = {%0A          + "Environment" = "Production"%0A        }%0A      + tags_all          = {%0A          + "Environment" = "Production"%0A        }%0A%0A      + default_action {%0A          + order = (known after apply)%0A          + type  = "redirect"%0A%0A          + redirect {%0A              + host        = "#{host}"%0A              + path        = "/#{path}"%0A              + port        = "443"%0A              + protocol    = "HTTPS"%0A              + query       = "#{query}"%0A              + status_code = "HTTP_301"%0A            }%0A        }%0A%0A      + mutual_authentication {%0A          + ignore_client_certificate_expiry = (known after apply)%0A          + mode                             = (known after apply)%0A          + trust_store_arn                  = (known after apply)%0A        }%0A    }%0A%0A  # module.alb.aws_lb_listener.frontend_https[0] will be created%0A  + resource "aws_lb_listener" "frontend_https" {%0A      + arn               = (known after apply)%0A      + certificate_arn   = (known after apply)%0A      + id                = (known after apply)%0A      + load_balancer_arn = (known after apply)%0A      + port              = 443%0A      + protocol          = "HTTPS"%0A      + ssl_policy        = "ELBSecurityPolicy-2016-08"%0A      + tags              = {%0A          + "Environment" = "Production"%0A        }%0A      + tags_all          = {%0A          + "Environment" = "Production"%0A        }%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A%0A      + mutual_authentication {%0A          + ignore_client_certificate_expiry = (known after apply)%0A          + mode                             = (known after apply)%0A          + trust_store_arn                  = (known after apply)%0A        }%0A    }%0A%0A  # module.alb.aws_lb_target_group.main[0] will be created%0A  + resource "aws_lb_target_group" "main" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = (known after apply)%0A      + name_prefix                        = "Prod"%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "Environment" = "Production"%0A          + "Name"        = "Prod"%0A        }%0A      + tags_all                           = {%0A          + "Environment" = "Production"%0A          + "Name"        = "Prod"%0A        }%0A      + target_type                        = "instance"%0A      + vpc_id                             = (known after apply)%0A%0A      + health_check {%0A          + enabled             = (known after apply)%0A          + healthy_threshold   = (known after apply)%0A          + interval            = (known after apply)%0A          + matcher             = (known after apply)%0A          + path                = (known after apply)%0A          + port                = (known after apply)%0A          + protocol            = (known after apply)%0A          + timeout             = (known after apply)%0A          + unhealthy_threshold = (known after apply)%0A        }%0A%0A      + stickiness {%0A          + cookie_duration = (known after apply)%0A          + cookie_name     = (known after apply)%0A          + enabled         = (known after apply)%0A          + type            = (known after apply)%0A        }%0A%0A      + target_failover {%0A          + on_deregistration = (known after apply)%0A          + on_unhealthy      = (known after apply)%0A        }%0A%0A      + target_group_health {%0A          + dns_failover {%0A              + minimum_healthy_targets_count      = (known after apply)%0A              + minimum_healthy_targets_percentage = (known after apply)%0A            }%0A%0A          + unhealthy_state_routing {%0A              + minimum_healthy_targets_count      = (known after apply)%0A              + minimum_healthy_targets_percentage = (known after apply)%0A            }%0A        }%0A%0A      + target_health_state {%0A          + enable_unhealthy_connection_termination = (known after apply)%0A          + unhealthy_draining_interval             = (known after apply)%0A        }%0A    }%0A%0A  # module.asg.aws_autoscaling_group.this[0] will be created%0A  + resource "aws_autoscaling_group" "this" {%0A      + arn                              = (known after apply)%0A      + availability_zones               = (known after apply)%0A      + default_cooldown                 = (known after apply)%0A      + desired_capacity                 = 3%0A      + force_delete                     = false%0A      + force_delete_warm_pool           = false%0A      + health_check_grace_period        = 200%0A      + health_check_type                = "EC2"%0A      + id                               = (known after apply)%0A      + ignore_failed_scaling_activities = false%0A      + load_balancers                   = (known after apply)%0A      + max_size                         = 5%0A      + metrics_granularity              = "1Minute"%0A      + min_size                         = 1%0A      + name                             = (known after apply)%0A      + name_prefix                      = "shodapp_auto_scaling_group-"%0A      + predicted_capacity               = (known after apply)%0A      + protect_from_scale_in            = false%0A      + service_linked_role_arn          = (known after apply)%0A      + target_group_arns                = (known after apply)%0A      + termination_policies             = []%0A      + vpc_zone_identifier              = (known after apply)%0A      + wait_for_capacity_timeout        = "10m"%0A      + warm_pool_size                   = (known after apply)%0A%0A      + launch_template {%0A          + id      = (known after apply)%0A          + name    = (known after apply)%0A          + version = (known after apply)%0A        }%0A%0A      + mixed_instances_policy {%0A          + instances_distribution {%0A              + on_demand_allocation_strategy            = (known after apply)%0A              + on_demand_base_capacity                  = (known after apply)%0A              + on_demand_percentage_above_base_capacity = (known after apply)%0A              + spot_allocation_strategy                 = (known after apply)%0A              + spot_instance_pools                      = (known after apply)%0A              + spot_max_price                           = (known after apply)%0A            }%0A%0A          + launch_template {%0A              + launch_template_specification {%0A                  + launch_template_id   = (known after apply)%0A                  + launch_template_name = (known after apply)%0A                  + version              = (known after apply)%0A                }%0A%0A              + override {%0A                  + instance_type     = (known after apply)%0A                  + weighted_capacity = (known after apply)%0A%0A                  + instance_requirements {%0A                      + accelerator_manufacturers                               = (known after apply)%0A                      + accelerator_names                                       = (known after apply)%0A                      + accelerator_types                                       = (known after apply)%0A                      + allowed_instance_types                                  = (known after apply)%0A                      + bare_metal                                              = (known after apply)%0A                      + burstable_performance                                   = (known after apply)%0A                      + cpu_manufacturers                                       = (known after apply)%0A                      + excluded_instance_types                                 = (known after apply)%0A                      + instance_generations                                    = (known after apply)%0A                      + local_storage                                           = (known after apply)%0A                      + local_storage_types                                     = (known after apply)%0A                      + max_spot_price_as_percentage_of_optimal_on_demand_price = (known after apply)%0A                      + on_demand_max_price_percentage_over_lowest_price        = (known after apply)%0A                      + require_hibernate_support                               = (known after apply)%0A                      + spot_max_price_percentage_over_lowest_price             = (known after apply)%0A%0A                      + accelerator_count {%0A                          + max = (known after apply)%0A                          + min = (known after apply)%0A                        }%0A%0A                      + accelerator_total_memory_mib {%0A                          + max = (known after apply)%0A                          + min = (known after apply)%0A                        }%0A%0A                      + baseline_ebs_bandwidth_mbps {%0A                          + max = (known after apply)%0A                          + min = (known after apply)%0A                        }%0A%0A                      + memory_gib_per_vcpu {%0A                          + max = (known after apply)%0A                          + min = (known after apply)%0A                        }%0A%0A                      + memory_mib {%0A                          + max = (known after apply)%0A                          + min = (known after apply)%0A                        }%0A%0A                      + network_bandwidth_gbps {%0A                          + max = (known after apply)%0A                          + min = (known after apply)%0A                        }%0A%0A                      + network_interface_count {%0A                          + max = (known after apply)%0A                          + min = (known after apply)%0A                        }%0A%0A                      + total_local_storage_gb {%0A                          + max = (known after apply)%0A                          + min = (known after apply)%0A                        }%0A%0A                      + vcpu_count {%0A                          + max = (known after apply)%0A                          + min = (known after apply)%0A                        }%0A                    }%0A%0A                  + launch_template_specification {%0A                      + launch_template_id   = (known after apply)%0A                      + launch_template_name = (known after apply)%0A                      + version              = (known after apply)%0A                    }%0A                }%0A            }%0A        }%0A%0A      + tag {%0A          + key                 = "Name"%0A          + propagate_at_launch = true%0A          + value               = "shodapp_auto_scaling_group"%0A        }%0A%0A      + timeouts {}%0A%0A      + traffic_source {%0A          + identifier = (known after apply)%0A          + type       = (known after apply)%0A        }%0A    }%0A%0A  # module.asg.aws_launch_template.this[0] will be created%0A  + resource "aws_launch_template" "this" {%0A      + arn                    = (known after apply)%0A      + default_version        = (known after apply)%0A      + description            = "Launch template for ASG"%0A      + id                     = (known after apply)%0A      + image_id               = "ami-052b9fbb6949f883a"%0A      + instance_type          = "t2.micro"%0A      + latest_version         = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = "shodan-app-launch-template-"%0A      + tags_all               = (known after apply)%0A      + update_default_version = true%0A      + user_data              = (sensitive value)%0A      + vpc_security_group_ids = (known after apply)%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_protocol_ipv6          = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + monitoring {%0A          + enabled = true%0A        }%0A    }%0A%0A  # module.vpc.aws_default_route_table.default[0] will be created%0A  + resource "aws_default_route_table" "default" {%0A      + arn                    = (known after apply)%0A      + default_route_table_id = (known after apply)%0A      + id                     = (known after apply)%0A      + owner_id               = (known after apply)%0A      + route                  = (known after apply)%0A      + tags                   = {%0A          + "Name" = "py-prod-proj-vpc-default"%0A        }%0A      + tags_all               = {%0A          + "Name" = "py-prod-proj-vpc-default"%0A        }%0A      + vpc_id                 = (known after apply)%0A%0A      + timeouts {%0A          + create = "5m"%0A          + update = "5m"%0A        }%0A    }%0A%0A  # module.vpc.aws_internet_gateway.this[0] will be created%0A  + resource "aws_internet_gateway" "this" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags     = {%0A          + "Name" = "py-prod-proj-vpc"%0A        }%0A      + tags_all = {%0A          + "Name" = "py-prod-proj-vpc"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route.public_internet_gateway[0] will be created%0A  + resource "aws_route" "public_internet_gateway" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + gateway_id             = (known after apply)%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A%0A      + timeouts {%0A          + create = "5m"%0A        }%0A    }%0A%0A  # module.vpc.aws_route_table.private[0] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Name" = "py-prod-proj-vpc-private-us-east-1a"%0A        }%0A      + tags_all         = {%0A          + "Name" = "py-prod-proj-vpc-private-us-east-1a"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table.private[1] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Name" = "py-prod-proj-vpc-private-us-east-1b"%0A        }%0A      + tags_all         = {%0A          + "Name" = "py-prod-proj-vpc-private-us-east-1b"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table.public[0] will be created%0A  + resource "aws_route_table" "public" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Name" = "py-prod-proj-vpc-public"%0A        }%0A      + tags_all         = {%0A          + "Name" = "py-prod-proj-vpc-public"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.private[0] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.private[1] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.public[0] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.public[1] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.private[0] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.10.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "py-prod-proj-vpc-private-us-east-1a"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "py-prod-proj-vpc-private-us-east-1a"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.private[1] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.10.2.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "py-prod-proj-vpc-private-us-east-1b"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "py-prod-proj-vpc-private-us-east-1b"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.public[0] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.10.3.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "py-prod-proj-vpc-public-us-east-1a"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "py-prod-proj-vpc-public-us-east-1a"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.public[1] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.10.4.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "py-prod-proj-vpc-public-us-east-1b"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "py-prod-proj-vpc-public-us-east-1b"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_vpc.this[0] will be created%0A  + resource "aws_vpc" "this" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.10.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags                                 = {%0A          + "Name" = "py-prod-proj-vpc"%0A        }%0A      + tags_all                             = {%0A          + "Name" = "py-prod-proj-vpc"%0A        }%0A    }%0A%0A  # module.waf.aws_wafv2_web_acl.main[0] will be created%0A  + resource "aws_wafv2_web_acl" "main" {%0A      + application_integration_url = (known after apply)%0A      + arn                         = (known after apply)%0A      + capacity                    = (known after apply)%0A      + id                          = (known after apply)%0A      + lock_token                  = (known after apply)%0A      + name                        = "shodan_waf"%0A      + scope                       = "REGIONAL"%0A      + tags_all                    = (known after apply)%0A%0A      + default_action {%0A%0A          + block {%0A            }%0A        }%0A%0A      + rule {%0A          + name     = "Allow_results_html"%0A          + priority = 0%0A%0A          + action {%0A              + allow {%0A                }%0A            }%0A%0A          + statement {%0A%0A              + regex_pattern_set_reference_statement {%0A                  + arn = (known after apply)%0A%0A                  + field_to_match {%0A%0A                      + uri_path {}%0A                    }%0A%0A                  + text_transformation {%0A                      + priority = 0%0A                      + type     = "LOWERCASE"%0A                    }%0A                }%0A            }%0A%0A          + visibility_config {%0A              + cloudwatch_metrics_enabled = true%0A              + metric_name                = "RegexBadBotsUserAgent-metric"%0A              + sampled_requests_enabled   = false%0A            }%0A        }%0A      + rule {%0A          + name     = "IpSetRule-0"%0A          + priority = 1%0A%0A          + action {%0A              + allow {%0A                }%0A            }%0A%0A          + statement {%0A%0A              + ip_set_reference_statement {%0A                  + arn = (known after apply)%0A                }%0A            }%0A%0A          + visibility_config {%0A              + cloudwatch_metrics_enabled = true%0A              + metric_name                = "allow-specific-ip"%0A              + sampled_requests_enabled   = true%0A            }%0A        }%0A      + rule {%0A          + name     = "Block_all_routes_that_not_allowed"%0A          + priority = 5%0A%0A          + action {%0A%0A              + block {%0A                }%0A            }%0A%0A          + statement {%0A%0A              + regex_pattern_set_reference_statement {%0A                  + arn = (known after apply)%0A%0A                  + field_to_match {%0A%0A                      + uri_path {}%0A                    }%0A%0A                  + text_transformation {%0A                      + priority = 0%0A                      + type     = "LOWERCASE"%0A                    }%0A                }%0A            }%0A%0A          + visibility_config {%0A              + cloudwatch_metrics_enabled = true%0A              + metric_name                = "RegexBadBotsUserAgent-metric"%0A              + sampled_requests_enabled   = false%0A            }%0A        }%0A%0A      + visibility_config {%0A          + cloudwatch_metrics_enabled = true%0A          + metric_name                = "shodan-app"%0A          + sampled_requests_enabled   = true%0A        }%0A    }%0A%0A  # module.waf.aws_wafv2_web_acl_association.main[0] will be created%0A  + resource "aws_wafv2_web_acl_association" "main" {%0A      + id           = (known after apply)%0A      + resource_arn = (known after apply)%0A      + web_acl_arn  = (known after apply)%0A    }%0A%0APlan: 36 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + alb                  = {%0A      + http_tcp_listener_arns    = [%0A          + (known after apply),%0A        ]%0A      + http_tcp_listener_ids     = [%0A          + (known after apply),%0A        ]%0A      + https_listener_arns       = [%0A          + (known after apply),%0A        ]%0A      + https_listener_ids        = [%0A          + (known after apply),%0A        ]%0A      + lb_arn                    = (known after apply)%0A      + lb_arn_suffix             = (known after apply)%0A      + lb_dns_name               = (known after apply)%0A      + lb_id                     = (known after apply)%0A      + lb_zone_id                = (known after apply)%0A      + target_group_arn_suffixes = [%0A          + (known after apply),%0A        ]%0A      + target_group_arns         = [%0A          + (known after apply),%0A        ]%0A      + target_group_attachments  = {}%0A      + target_group_names        = [%0A          + (known after apply),%0A        ]%0A    }%0A  + dns_a_record_route53 = "https://shodapp.seansalmassi.com"%0A
::debug::stderr: 
::debug::exitcode: 0

```
</details>

*Pushed by: @batzsalmassi, Action: `pull_request`*